In [1]:
import pandas as pd
import sqlite3

In [33]:
orders = pd.read_csv("orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-23,842.97,New Foods Chinese
1,2,2693,309,18-01-23,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-23,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-23,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-23,1321.91,Royal Eatery South Indian

In [34]:
users = pd.read_json("users.json")
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [4]:
conn = sqlite3.connect("restaurants.db")

with open("restaurants.sql", "r") as file:
    conn.executescript(file.read())

restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [11]:
orders_users = pd.merge(
    orders,
    users,
    on="user_id",
    how="left"
)

In [35]:
final_df = pd.merge(
    orders_users,
    restaurants,
    on="restaurant_id",
    how="left"
)

final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-23,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-23,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-23,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-23,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-23,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [36]:
final_df.shape
final_df.isnull().sum()

order_id             0
user_id              0
restaurant_id        0
order_date           0
total_amount         0
restaurant_name_x    0
name                 0
city                 0
membership           0
restaurant_name_y    0
cuisine              0
rating               0
dtype: int64

In [8]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

In [37]:
final_df[final_df["membership"]=="Gold"].groupby("city")["total_amount"].sum().idxmax()

'Chennai'

In [38]:
final_df.groupby("cuisine")["total_amount"].mean().sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [39]:

result = int(final_df.groupby("user_id")["total_amount"].sum().gt(1000).sum())
print("Users spending > ₹1000:", result)

Users spending > ₹1000: 2544

In [82]:
# Step 1: Define rating bins and labels
bins = [0, 3, 3.5, 3.6, 4, 4.1, 4.5, 4.6, 5]
labels = ["0–3", "3–3.5", "3.5–3.6", "3.6–4", "4–4.1", "4.1–4.5", "4.5–4.6", "4.6–5"]

# Step 2: Categorize restaurant ratings into bins
final_df["rating_range"] = pd.cut(
    final_df["rating"],
    bins=bins,
    labels=labels,
    include_lowest=True
)

# Step 3: Group by rating range and sum total revenue
rating_revenue = final_df.groupby("rating_range", observed=True)["total_amount"].sum()

# Step 4: Find the rating range with highest revenue
top_rating_range = rating_revenue.idxmax()

# Step 5: Display the result
print("Rating range with highest total revenue:", top_rating_range)

Rating range with highest total revenue: 3–3.5

In [42]:
revenue_by_range.idxmax()

'4.6–5.0'

In [43]:
gold_avg = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .mean()
    .sort_values(ascending=False)
)

gold_avg

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [26]:
gold_avg.idxmax()

'Chennai'

In [44]:
cuisine_stats = final_df.groupby("cuisine").agg(
    distinct_restaurants=("restaurant_id", "nunique"),
    total_revenue=("total_amount", "sum")
).sort_values("distinct_restaurants")

cuisine_stats

         distinct_restaurants  total_revenue
cuisine
Chinese                   120     1930504.65
Indian                    126     1971412.58
Italian                   126     2024203.80
Mexican                   128     2085503.09

In [28]:
cuisine_stats.iloc[0]

distinct_restaurants        120.00
total_revenue           1930504.65
Name: Chinese, dtype: float64

In [51]:
gold_orders = final_df[final_df["membership"] == "Gold"].shape[0]
total_orders = final_df.shape[0]

percentage = round((gold_orders / total_orders) * 100)
percentage

50

In [61]:
cuisine_summary = final_df.groupby("cuisine").agg(
    distinct_restaurants=("restaurant_id", "nunique"),
    total_revenue=("total_amount", "sum")
)

# Sort by lowest number of restaurants
cuisine_summary.sort_values("distinct_restaurants")

         distinct_restaurants  total_revenue
cuisine
Chinese                   120     1930504.65
Indian                    126     1971412.58
Italian                   126     2024203.80
Mexican                   128     2085503.09

In [62]:
cuisine_summary.sort_values("distinct_restaurants").head(1)

         distinct_restaurants  total_revenue
cuisine
Chinese                   120     1930504.65

In [57]:
final_df.groupby(["membership", "cuisine"])["total_amount"] \
        .sum() \
        .sort_values(ascending=False)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [83]:
# Step 1: Ensure order_date is datetime
final_df['order_date'] = pd.to_datetime(final_df['order_date'], dayfirst=True)  # dayfirst=True for DD-MM-YYYY

# Step 2: Extract quarter
final_df['quarter'] = final_df['order_date'].dt.quarter

# Step 3: Group by quarter and sum total revenue
quarter_revenue = final_df.groupby('quarter').agg(
    total_revenue=('total_amount', 'sum')
).reset_index()

# Step 4: Find the quarter with highest revenue
top_quarter_num = quarter_revenue.loc[quarter_revenue['total_revenue'].idxmax(), 'quarter']

# Step 5: Map quarter number to label and display
quarter_map = {1: 'Q1 (Jan–Mar)', 2: 'Q2 (Apr–Jun)', 3: 'Q3 (Jul–Sep)', 4: 'Q4 (Oct–Dec)'}
top_quarter = quarter_map[top_quarter_num]

print(top_quarter)

Q3 (Jul–Sep)

In [63]:
gold_orders_count = final_df[final_df["membership"] == "Gold"].shape[0]
gold_orders_count

4987

In [64]:
hyderabad_revenue = round(
    final_df[final_df["city"] == "Hyderabad"]["total_amount"].sum()
)

hyderabad_revenue

1889367

In [65]:
distinct_users = final_df["user_id"].nunique()
distinct_users

2883

In [66]:
gold_avg_order_value = round(
    final_df[final_df["membership"] == "Gold"]["total_amount"].mean(), 2
)

gold_avg_order_value

np.float64(797.15)

In [67]:
high_rating_orders = final_df[final_df["rating"] >= 4.5].shape[0]
high_rating_orders

3374

In [68]:

top_city = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .sum()
    .idxmax()
)

top_city

'Chennai'

In [69]:

orders_count = final_df[
    (final_df["membership"] == "Gold") & 
    (final_df["city"] == top_city)
].shape[0]

orders_count

1337

In [70]:
orders_users = pd.merge(
    orders,
    users,
    on="user_id",
    how="left"
)

In [74]:
final_df.shape[0]

10000

In [75]:
orders_users = pd.merge(
    orders,
    users,
    on="user_id",
    how="left"
)

In [76]:
final_df = pd.merge(
    orders_users,
    restaurants,
    on="restaurant_id",
    how="left"
)